app/views/posts/all_posts.html.erb

              <td style="border:1px solid #000;border-top: none;"><%=post.title  %></td>
              <td style="border:1px solid #000; border-left: none;border-top: none;"><%= post.user.email unless post.user.blank? %></td>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1