app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])
    @post.user_id = current_user.id

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`created_at`, `description`, `title`, `updated_at`, `user_id`) VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 16 Jun 2012 10:08:37 UTC +00:00], ["description", "wwwwwwwwwwwwwwwww"], ["title", "wwwwwwwww"], ["updated_at", Sat, 16 Jun 2012 10:08:37 UTC +00:00], ["user_id", 1]]